#include "User.h"

namespace Irc {
/************************************************************
*				🥚 CONSTRUCTORS & DESTRUCTOR				*
************************************************************/

User::User(void) : nickname_(""), username_(""), opname_("") {}

User::User(const User& inst) : nickname_(inst.nickname_), username_(inst.username_), opname_(inst.opname_) {}

User::~User(void) {}

/************************************************************
*				➕ OPERATORS									*
************************************************************/

User& User::operator=(const User& inst) 
{
	if (this != &inst)
	{
	}
	return (*this);
}

/*************************************************************
*		        🛠️ FUNCTIONS								*
*************************************************************/


/*************************************************************
*		    👁️‍ GETTERS and SETTERS				 			*
*************************************************************/

}